БухгалтерскиеЗадачиКР/src/Documents/ВыплатыДенежныхСредств/ВыплатыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыплатыДенежныхСредств</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Наличные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСчет</name>
    <type>
      <types>ChartOfAccountsRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто1</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСубконто2</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
</mdclass:Document>

БухгалтерскиеЗадачиКР/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Счета</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.ПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Счета.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаМСФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

БухгалтерскиеЗадачиКР/src/ChartsOfAccounts/Счета/Счета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Счета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
      <code>10</code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41</code>
      <childItems>
        <name>ТоварыОпт</name>
        <description>Товары опт</description>
        <code>41.1</code>
      </childItems>
      <childItems>
        <name>ТоварыРозница</name>
        <description>Товары розница</description>
        <code>41.2</code>
      </childItems>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50</code>
    </items>
    <items>
      <name>СчетВБанке</name>
      <description>Счет в банке</description>
      <code>51</code>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
      <code>60</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
      <code>62</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПокупателямОтгрузили</name>
        <description>Покупателям отгрузили</description>
        <code>62.1</code>
      </childItems>
      <childItems>
        <name>АвансОтПокупателей</name>
        <description>Аванс от покупателей</description>
        <code>62.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>ЗарплатаСотрудников</name>
      <description>Зарплата сотрудников</description>
      <code>70</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасходыДоходы</name>
      <description>Расходы доходы</description>
      <code>90</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ХранениеТоваров</name>
      <description>Хранение товаров</description>
      <code>001</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЭтоГруппа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>ПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

БухгалтерскиеЗадачиКР/src/Documents/ВыплатыДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
		, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	
		  Индекс = ПроверяемыеРеквизиты.Найти("Подразделение");
			ПроверяемыеРеквизиты.Удалить(Индекс);
			
	
	КонецЕсли;                      
	
	Если ПолучитьФункциональнуюОпцию("ВалютныйУчет"
		, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	
		  Индекс = ПроверяемыеРеквизиты.Найти("Валюта");
			ПроверяемыеРеквизиты.Удалить(Индекс);
			
	
	КонецЕсли;                      
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	Движения.Проводки.БлокироватьДляИзменения = Истина;
	
	Движение = Движения.Проводки.Добавить();
	
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Выплатили денежные средства";
	
	Движение.СчетДт = КорСчет;
	Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");
	Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,1,КорСубконто1,"Дт");
	Серверный.ЗаполнитьСубконтоСтороныПроводки(Движение,2,КорСубконто2,"Дт");
	Серверный.ЗаполнитьВалютуСтороныПроводки(Движение,Валюта, Сумма,"Дт");
	
	Движение.СчетКт = ?(Наличные, ПланыСчетов.Счета.Касса, ПланыСчетов.Счета.СчетВБанке);
	Серверный.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");
	Серверный.ЗаполнитьВалютуСтороныПроводки(Движение,Валюта, Сумма,"Кт");
	
	Движения.Записать();
	
    //-------Проверка остатка -----
	
	Запрос = Новый Запрос;
	
	//Если Движение.СчетКт.ПоПодразделениям Тогда
	//
	//	Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПроводкиОстатки.СуммаОстатокДт
	//	|ИЗ
	//	|	РегистрБухгалтерии.Проводки.Остатки(
	//	|			&Период,
	//	|			Счет = &СчетУчетаДС,
	//	|			,
	//	|			Организация = &Организация
	//	|				И Подразделение = &Подразделение) КАК ПроводкиОстатки
	//	|ГДЕ
	//	|	ПроводкиОстатки.СуммаОстатокДт < 0";
	//
	//Иначе
	
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкиОстатки.СуммаОстатокДт
		|ИЗ
		|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет = &СчетУчетаДС, , Организация = &Организация) КАК ПроводкиОстатки
		|ГДЕ
		|	ПроводкиОстатки.СуммаОстатокДт < 0";
		
	
	//КонецЕсли;
	
	
	ИзменитьТекстЗапроса(Запрос, Движение.СчетКт);
	
	
	СчетУчетаДС = ?(Наличные, ПланыСчетов.Счета.Касса, ПланыСчетов.Счета.СчетВБанке);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Включая) );
	Запрос.УстановитьПараметр("СчетУчетаДС", СчетУчетаДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
		
		Отказ = Истина;
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нехватает денежных средств. Нехвакта "
		+ ?(Движение.СчетКт.Валютный
		,ВыборкаДетальныеЗаписи.СуммаВалютыОстатокДт
		,ВыборкаДетальныеЗаписи.СуммаОстатокДт) + " " + Валюта;
		
		Сообщение.Поле = "Сумма";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	
	КонецЕсли;

КонецПроцедуры

Процедура ИзменитьТекстЗапроса(Запрос, Счет)
	
	СхемаЗапроса = Новый СхемаЗапроса;
	
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	
	Если Счет.ПоПодразделениям Тогда
		
		Таблица_Из = СхемаЗапроса.ПакетЗапросов.Получить(0).Операторы.Получить(0).Источники.Получить(0);
		
		УсловиеНаИзмерение = Строка(Таблица_Из.Источник.Параметры.Получить(3).Выражение);
		
		Таблица_Из.Источник.Параметры.Получить(3).Выражение =
		Новый ВыражениеСхемыЗапроса("" + УсловиеНаИзмерение + " И Подразделение = &Подразделение");
		
		
		
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
		
	КонецЕсли;
	
	Если Счет.Валютный Тогда
		
		Таблица_Из = СхемаЗапроса.ПакетЗапросов.Получить(0).Операторы.Получить(0).Источники.Получить(0);
		
		УсловиеНаИзмерение = Строка(Таблица_Из.Источник.Параметры.Получить(3).Выражение);
		
		Таблица_Из.Источник.Параметры.Получить(3).Выражение =
		Новый ВыражениеСхемыЗапроса("" + УсловиеНаИзмерение + " И Валюта = &Валюта");
		
		СхемаЗапроса.ПакетЗапросов[0].Операторы[0].ВыбираемыеПоля.Установить(0,
		Новый ВыражениеСхемыЗапроса("ПроводкиОстатки.СуммаВалютыОстатокДт"));
		
		СхемаЗапроса.ПакетЗапросов.Получить(0).Операторы.Получить(0).Отбор.Установить(0,
		Новый ВыражениеСхемыЗапроса("ПроводкиОстатки.СуммаВалютыОстатокДт < 0"));
		
		
		Запрос.УстановитьПараметр("Валюта", Валюта);
	
		
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецПроцедуры
